Tekla Open API Reference for Tekla Structures 2025
OkApplyCancel Class
 The OkApplyCancel class represents a control including the Ok-Apply-Cancel button group.
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 System.Windows.Forms.Control
 System.Windows.Forms.ScrollableControl
 System.Windows.Forms.ContainerControl
 System.Windows.Forms.UserControl
 Tekla.Structures.Dialog.UIControls.OkApplyCancel
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class OkApplyCancel : UserControl
Public Class OkApplyCancel
	Inherits UserControl
The OkApplyCancel type exposes the following members.
Constructors
Name | Description
OkApplyCancel
 Initializes a new instance of the OkApplyCancel class.
Top
Events
Name | Description
ApplyClicked
 The ApplyClicked event is raised when the Apply button is clicked.
CancelClicked
 The CancelClicked event is raised when the Cancel button is clicked.
OkClicked
 The OkClicked event is raised when the Ok button is clicked.
Top
See Also
Reference
Tekla.Structures.Dialog.UIControls Namespace